//@skip-check object-module-export-variable
//@skip-check module-accessibility-at-client

#Область ОписаниеПеременных

Перем СхемаКомпоновкиДанных Экспорт;
Перем НастройкиКомпновкиДанных Экспорт;
Перем ДанныеРасшифровкиКомпоновкиДанных Экспорт;
Перем КомпоновщикМакетаКомпоновкиДанных Экспорт;
Перем МакетКомпоновкиДанных Экспорт;

Перем ДеревоЭлементовМакета Экспорт;
Перем ГруппировкиМакета Экспорт;

#КонецОбласти

Функция Схема(_Схема) Экспорт
	СхемаКомпоновкиДанных = _Схема;
	Возврат ЭтотОбъект;
КонецФункции

Функция Настройки(_Настройки) Экспорт
	НастройкиКомпновкиДанных = _Настройки;
	Возврат ЭтотОбъект;
КонецФункции

Функция Скомпоновать() Экспорт
	ДанныеРасшифровкиКомпоновкиДанных = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпновкиДанных, ДанныеРасшифровкиКомпоновкиДанных);
	Возврат ЭтотОбъект;
КонецФункции

Функция ВывестиВТабличныйДокумент(Результат) Экспорт
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровкиКомпоновкиДанных);
	//  Вывод результата в отчет
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат ЭтотОбъект;
КонецФункции

Функция УстановитьИдентификаторТаблицы(ИдентификаторТаблицы = "") Экспорт
	Для Каждого ОписаниеМакета Из МакетКомпоновкиДанных.Макеты Цикл
		Макет = ОписаниеМакета.Макет;
		Если ТипЗнч(Макет) <> Тип("МакетОбластиКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаТаблицыОбласти Из Макет Цикл
			СтрокаТаблицыОбласти.ИдентификаторТаблицы = ИдентификаторТаблицы;
		КонецЦикла;
	КонецЦикла;
	Возврат ЭтотОбъект;
КонецФункции

Процедура ДобавитьЭлементыМакета(ДеревоЭлементовМакета, ЭлементМакета, МакетКомпоновкиДанных)
	ТипЭлемента = ТипЗнч(ЭлементМакета);
	
	Если ТипЭлемента = Тип("ВложенныйОбъектМакетаКомпоновкиДанных") Тогда
		ОписаниеЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
		ОписаниеЭлементаМакета.Тип = "ВложенныйОбъектМакетаКомпоновкиДанных";
		ЗаполнитьЗначенияСвойств(ОписаниеЭлементаМакета, ЭлементМакета);
		ПодчиненныеЭлементы = Новый Массив;
		ДобавитьЭлементыМакета(ПодчиненныеЭлементы, ЭлементМакета.КомпоновкаДанных, ЭлементМакета.КомпоновкаДанных);
		ОписаниеЭлементаМакета.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
//		Для Каждого ОписаниеМакета Из ЭлементМакета.КомпоновкаДанных.Макеты Цикл
//			Макет = ОписаниеМакета.Макет;
//			Если ТипЗнч(Макет) <> Тип("МакетОбластиКомпоновкиДанных") Тогда
//				Продолжить;
//			КонецЕсли;
//			Макет[0].ИдентификаторТаблицы = ИдентификаторТаблицы;
//		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для Каждого ПодчиненныйЭлементМакета Из ЭлементМакета.Тело Цикл
		ТипПодчиненногоЭлемента = ТипЗнч(ПодчиненныйЭлементМакета);
		Если ТипПодчиненногоЭлемента = Тип("МакетОбластиМакетаКомпоновкиДанных") Тогда
			ОписаниеЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
			ОписаниеЭлементаМакета.Тип = "МакетОбластиМакетаКомпоновкиДанных";
			ОписаниеЭлементаМакета.Макет = ПодчиненныйЭлементМакета.Макет;
			Если ЗначениеЗаполнено(ПодчиненныйЭлементМакета.Макет) Тогда
				ОписаниеМакета = МакетКомпоновкиДанных.Макеты.Найти(ПодчиненныйЭлементМакета.Макет);
				Параметры = РаботаСМассивом.АТДМассив(ОписаниеМакета.Параметры)
					.Отобрать("ТипЗнч(Элемент) = Тип('ПараметрОбластиВыражениеКомпоновкиДанных')")
					.Отобразить("Новый Структура('Выражение, Имя', Элемент.Выражение, Элемент.Имя)")
					.ВМассив()
				;
				ПараметрыРасшифровки = РаботаСМассивом.АТДМассив(ОписаниеМакета.Параметры)
					.Отобрать("ТипЗнч(Элемент) = Тип('ПараметрОбластиРасшифровкаКомпоновкиДанных')")
					.Отобразить("Новый Структура('ВыраженияПолей, Имя', Элемент.ВыраженияПолей, Элемент.Имя)")
					.ВМассив()
				;
				Для Каждого Элемент Из ПараметрыРасшифровки ЦИкл
					Элемент.ВыраженияПолей = РаботаСМассивом.АТДМассив(Элемент.ВыраженияПолей)
						.Отобразить("Новый Структура('Поле, Выражение', Элемент.Поле, Элемент.Выражение)")
						.ВМассив()
					;
				КонецЦикла;
				ОписаниеЭлементаМакета.Параметры = Параметры;
				ОписаниеЭлементаМакета.ПараметрыРасшифровки = ПараметрыРасшифровки;
			КонецЕсли;
			ДеревоЭлементовМакета.Добавить(ОписаниеЭлементаМакета);
			Продолжить;
		КонецЕсли;
		
		Если ТипПодчиненногоЭлемента = Тип("ГруппировкаМакетаКомпоновкиДанных") Тогда
			ПоляГруппировки = РаботаСМассивом.АТДМассив(ПодчиненныйЭлементМакета.Группировка)
				.Отобразить("Элемент.ИмяПоля")
				.ВМассив()
			;
			ОписаниеЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
			ОписаниеЭлементаМакета.Тип = Строка(ТипПодчиненногоЭлемента);
			ЗаполнитьЗначенияСвойств(ОписаниеЭлементаМакета, ПодчиненныйЭлементМакета);
			ОписаниеЭлементаМакета.ПоляГруппировки = ПоляГруппировки;
			ПодчиненныеЭлементы = Новый Массив;
			ДобавитьЭлементыМакета(ПодчиненныеЭлементы, ПодчиненныйЭлементМакета, МакетКомпоновкиДанных);
			ОписаниеЭлементаМакета.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
			Если ЗначениеЗаполнено(ПодчиненныйЭлементМакета.МакетПодвала) Тогда
				ОписаниеМакета = МакетКомпоновкиДанных.Макеты.Найти(ПодчиненныйЭлементМакета.МакетПодвала);
				Параметры = РаботаСМассивом.АТДМассив(ОписаниеМакета.Параметры)
					.Отобрать("ТипЗнч(Элемент) = Тип('ПараметрОбластиВыражениеКомпоновкиДанных')")
					.Отобразить("Новый Структура('Выражение, Имя', Элемент.Выражение, Элемент.Имя)")
					.ВМассив()
				;
				ПараметрыРасшифровки = РаботаСМассивом.АТДМассив(ОписаниеМакета.Параметры)
					.Отобрать("ТипЗнч(Элемент) = Тип('ПараметрОбластиРасшифровкаКомпоновкиДанных')")
					.Отобразить("Новый Структура('ВыраженияПолей, Имя', Элемент.ВыраженияПолей, Элемент.Имя)")
					.ВМассив()
				;
				Для Каждого Элемент Из ПараметрыРасшифровки ЦИкл
					Элемент.ВыраженияПолей = РаботаСМассивом.АТДМассив(Элемент.ВыраженияПолей)
						.Отобразить("Новый Структура('Поле, Выражение', Элемент.Поле, Элемент.Выражение)")
						.ВМассив()
					;
				КонецЦикла;
				ОписаниеЭлементаМакета.Параметры = Параметры;
				ОписаниеЭлементаМакета.ПараметрыРасшифровки = ПараметрыРасшифровки;
			КонецЕсли;
			ДеревоЭлементовМакета.Добавить(ОписаниеЭлементаМакета);
			ГруппировкиМакета.Добавить(Новый Структура("Имя, Макет", ОписаниеЭлементаМакета.Имя, ОписаниеЭлементаМакета));
			Продолжить;
		КонецЕсли;
		
		Если ТипПодчиненногоЭлемента = Тип("МакетГруппировкиТаблицыМакетаКомпоновкиДанных") Тогда
			ОписаниеЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
			ОписаниеЭлементаМакета.Тип = Строка(ТипПодчиненногоЭлемента);
			ОписаниеЭлементаМакета.Макет = ПодчиненныйЭлементМакета.Макет;
			ДеревоЭлементовМакета.Добавить(ОписаниеЭлементаМакета);
			Продолжить;
		КонецЕсли;
		
		Если ТипПодчиненногоЭлемента = Тип("ТаблицаМакетаКомпоновкиДанных") Тогда
			ОписаниеЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
			ОписаниеЭлементаМакета.Тип = Строка(ТипПодчиненногоЭлемента);
			ЗаполнитьЗначенияСвойств(ОписаниеЭлементаМакета, ПодчиненныйЭлементМакета);
			Колонки = Новый Массив;
			Для Каждого ЭлементМакетаКолонки Из ПодчиненныйЭлементМакета.Колонки Цикл
				ТипПодчиненногоЭлемента = ТипЗнч(ЭлементМакетаКолонки);
	
				ПоляГруппировки = РаботаСМассивом.АТДМассив(ЭлементМакетаКолонки.Группировка)
					.Отобразить("Элемент.ИмяПоля")
					.ВМассив()
				;
				ОписаниеПодчиненногоЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
				ОписаниеПодчиненногоЭлементаМакета.Тип = Строка(ТипПодчиненногоЭлемента);
				ЗаполнитьЗначенияСвойств(ОписаниеПодчиненногоЭлементаМакета, ЭлементМакетаКолонки, "Имя, Идентификатор");
				ОписаниеПодчиненногоЭлементаМакета.ПоляГруппировки = ПоляГруппировки;
				ОписаниеПодчиненногоЭлементаМакета.МакетШапки = ЭлементМакетаКолонки.МакетШапки.Макет;
				ОписаниеПодчиненногоЭлементаМакета.МакетПодвала = ЭлементМакетаКолонки.МакетПодвала.Макет;
				
				ПодчиненныеЭлементы = Новый Массив;
				ДобавитьЭлементыМакета(ПодчиненныеЭлементы, ЭлементМакетаКолонки, МакетКомпоновкиДанных);
				ОписаниеПодчиненногоЭлементаМакета.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
				
				Колонки.Добавить(ОписаниеПодчиненногоЭлементаМакета);
			КонецЦикла;
			
			Строки = Новый Массив;
			Для Каждого ЭлементМакетаСтроки Из ПодчиненныйЭлементМакета.Колонки Цикл
				ТипПодчиненногоЭлемента = ТипЗнч(ЭлементМакетаСтроки);
	
				ПоляГруппировки = РаботаСМассивом.АТДМассив(ЭлементМакетаСтроки.Группировка)
					.Отобразить("Элемент.ИмяПоля")
					.ВМассив()
				;
				ОписаниеПодчиненногоЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
				ОписаниеПодчиненногоЭлементаМакета.Тип = Строка(ТипПодчиненногоЭлемента);
				ЗаполнитьЗначенияСвойств(ОписаниеПодчиненногоЭлементаМакета, ЭлементМакетаСтроки, "Имя, Идентификатор");
				ОписаниеПодчиненногоЭлементаМакета.ПоляГруппировки = ПоляГруппировки;
				ОписаниеПодчиненногоЭлементаМакета.МакетШапки = ЭлементМакетаСтроки.МакетШапки.Макет;
				ОписаниеПодчиненногоЭлементаМакета.МакетПодвала = ЭлементМакетаСтроки.МакетПодвала.Макет;
				
				ПодчиненныеЭлементы = Новый Массив;
				ДобавитьЭлементыМакета(ПодчиненныеЭлементы, ЭлементМакетаСтроки, МакетКомпоновкиДанных);
				ОписаниеПодчиненногоЭлементаМакета.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
				
				Строки.Добавить(ОписаниеПодчиненногоЭлементаМакета);
			КонецЦикла;
			
			ОписаниеЭлементаМакета.Вставить("Колонки", Колонки);
			ОписаниеЭлементаМакета.Вставить("Строки", Строки);
			
			ДеревоЭлементовМакета.Добавить(ОписаниеЭлементаМакета);
			Возврат;
		КонецЕсли;
		
		ОписаниеЭлементаМакета = Новый Структура("Тип, Имя, Идентификатор, МакетШапки, МакетПодвала, ПоляГруппировки, Макет, ПодчиненныеЭлементы, Параметры, ПараметрыРасшифровки");
		ОписаниеЭлементаМакета.Тип = Строка(ТипЭлемента);
		ЗаполнитьЗначенияСвойств(ОписаниеЭлементаМакета, ПодчиненныйЭлементМакета);
		ПодчиненныеЭлементы = Новый Массив;
		ДобавитьЭлементыМакета(ПодчиненныеЭлементы, ПодчиненныйЭлементМакета, МакетКомпоновкиДанных);
		ОписаниеЭлементаМакета.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
		ДеревоЭлементовМакета.Добавить(ОписаниеЭлементаМакета);
	КонецЦикла;
КонецПроцедуры

Функция СформироватьДеревоЭлементовМакета() Экспорт
	ГруппировкиМакета = Новый Массив;
	ДеревоЭлементовМакета = Новый Массив;
	ДобавитьЭлементыМакета(ДеревоЭлементовМакета, МакетКомпоновкиДанных, МакетКомпоновкиДанных);
КонецФункции
