Функция МодельСхемыКомпоновкиДанных() Экспорт
	МодельСхемыКомпоновкиДанных = Обработки.МодельСхемыКомпоновкиДанных.Создать();
	Возврат МодельСхемыКомпоновкиДанных;
КонецФункции

Функция МодельНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных) Экспорт
	МодельНастройки = Обработки.МодельНастройкиКомпоновкиДанных.Создать();
	МодельНастройки.Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Возврат МодельНастройки;
КонецФункции

Функция МодельМакетаКомпоновкиДанных() Экспорт
	МодельМакета = Обработки.МодельМакетаКомпоновкиДанных.Создать();
	Возврат МодельМакета;
КонецФункции

Функция МодельМакетаОбластиКомпоновкиДанных(МакетОбласти = Неопределено) Экспорт
	МодельМакетаОбласти = Обработки.МодельМакетаОбластиКомпоновкиДанных.Создать();
	Если МакетОбласти <> Неопределено Тогда
		МодельМакетаОбласти.МакетОбласти = МакетОбласти;
	КонецЕсли;
	Возврат МодельМакетаОбласти;
КонецФункции
